fedetft/miosix-kernel/miosix/arch/board/stm32f407vg_stm32f4discovery/interfaces-impl/bsp.cpp
/***************************************************************************
 *   Copyright (C) 2012, 2013, 2014 by Terraneo Federico                   *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   As a special exception, if other files instantiate templates or use   *
 *   macros or inline functions from this file, or you compile this file   *
 *   and link it with other works to produce a work based on this file,    *
 *   this file does not by itself cause the resulting work to be covered   *
 *   by the GNU General Public License. However the source code for this   *
 *   file must still be made available in accordance with the GNU General  *
 *   Public License. This exception does not invalidate any other reasons  *
 *   why a work based on this file might be covered by the GNU General     *
 *   Public License.                                                       *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, see <http://www.gnu.org/licenses/>   *
 ***************************************************************************/ 

/***********************************************************************
* bsp.cpp Part of the Miosix Embedded OS.
* Board support package, this file initializes hardware.
************************************************************************/

#include <cstdlib>
#include <inttypes.h>
#include <sys/ioctl.h>
#include "interfaces/bsp.h"
#include "interfaces_private/bsp_private.h"
#include "kernel/thread.h"
#include "kernel/sync.h"
#include "interfaces/delays.h"
#include "interfaces/poweroff.h"
#include "interfaces/arch_registers.h"
#include "miosix_settings.h"
#include "kernel/logging.h"
#include "filesystem/file_access.h"
#include "filesystem/console/console_device.h"
#include "interfaces/serial.h"
#include "drivers/sdmmc/stm32f2_f4_f7_sd.h"
#include "board_settings.h"
#include "filesystem/automounter/sd_automounter.h"

namespace miosix {

typedef Gpio<PD,4>  cs43l22reset;

//
// Initialization
//

void IRQbspInit()
{
    //Enable all gpios
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN | RCC_AHB1ENR_GPIOBEN |
                    RCC_AHB1ENR_GPIOCEN | RCC_AHB1ENR_GPIODEN |
                    RCC_AHB1ENR_GPIOEEN | RCC_AHB1ENR_GPIOHEN;
    RCC_SYNC();
    GPIOA->OSPEEDR=0xaaaaaaaa; //Default to 50MHz speed for all GPIOS
    GPIOB->OSPEEDR=0xaaaaaaaa;
    GPIOC->OSPEEDR=0xaaaaaaaa;
    GPIOD->OSPEEDR=0xaaaaaaaa;
    GPIOE->OSPEEDR=0xaaaaaaaa;
    GPIOH->OSPEEDR=0xaaaaaaaa;
    _led::mode(Mode::OUTPUT);
    ledOn();
    delayMs(100);
    ledOff();
    // On stm32f4discovery some of the SDIO pins conflict with the
    // audio output chip, so keep it permanently reset to avoid issues
    cs43l22reset::mode(Mode::OUTPUT);
    cs43l22reset::low();
    // Initialize default serial
    IRQsetDefaultConsole(
        STM32SerialBase::get<defaultSerialTxPin,defaultSerialRxPin,
        defaultSerialRtsPin,defaultSerialCtsPin>(
            defaultSerial,defaultSerialSpeed,
            defaultSerialFlowctrl,defaultSerialDma));

    #if defined(WITH_AUTOMOUNTER) && WITH_SD_CD_PIN
    sdAutomounterCardDetectPin::mode(sdAutomounterCdMode);
    #endif
}


void bspInit2()
{
    #ifdef WITH_FILESYSTEM
    #ifdef WITH_AUTOMOUNTER
    basicFilesystemSetup(intrusive_ref_ptr<Device>());
    SdAutomounter::instance().configure(SDIODriver::instance());
    SdAutomounter::instance().enable();
    #else //WITH_AUTOMOUNTER
    basicFilesystemSetup(SDIODriver::instance());
    #endif //WITH_AUTOMOUNTER

    #if defined(WITH_DEVFS) && defined(AUX_SERIAL)
    {
        intrusive_ref_ptr<DevFs> devFs = FilesystemManager::instance().getDevFs();
        if(devFs)
            devFs->addDevice(AUX_SERIAL,
                STM32SerialBase::get<auxSerialTxPin,auxSerialRxPin,
                auxSerialRtsPin,auxSerialCtsPin>(
                    auxSerial,auxSerialSpeed,auxSerialFlowctrl,auxSerialDma));
    }
    #endif //WITH_DEVFS && AUX_SERIAL
    #endif //WITH_FILESYSTEM
}

//
// Shutdown and reboot
//

/**
This function disables filesystem (if enabled), serial port (if enabled) and
puts the processor in deep sleep mode.<br>
Wakeup occurs when PA.0 goes high, but instead of sleep(), a new boot happens.
<br>This function does not return.<br>
WARNING: close all files before using this function, since it unmounts the
filesystem.<br>
When in shutdown mode, power consumption of the miosix board is reduced to ~
5uA??, however, true power consumption depends on what is connected to the GPIO
pins. The user is responsible to put the devices connected to the GPIO pin in the
minimal power consumption mode before calling shutdown(). Please note that to
minimize power consumption all unused GPIO must not be left floating.
*/
void shutdown()
{
    ioctl(STDOUT_FILENO,IOCTL_SYNC,0);

    #ifdef WITH_FILESYSTEM
    #ifdef WITH_AUTOMOUNTER
    SdAutomounter::instance().stop();
    #endif //WITH_AUTOMOUNTER
    FilesystemManager::instance().umountAll();
    #endif //WITH_FILESYSTEM

    FastGlobalIrqLock::lock();
    for(;;) ;
}

void reboot()
{
    ioctl(STDOUT_FILENO,IOCTL_SYNC,0);
    
    #ifdef WITH_FILESYSTEM
    #ifdef WITH_AUTOMOUNTER
    SdAutomounter::instance().stop();
    #endif //WITH_AUTOMOUNTER
    FilesystemManager::instance().umountAll();
    #endif //WITH_FILESYSTEM

    FastGlobalIrqLock::lock();
    IRQsystemReboot();
}

} //namespace miosix
